
===========================================================================
report_tns
============================================================================
tns -1.80

===========================================================================
report_wns
============================================================================
wns -0.77

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.77

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.19
