###############################################################################
# Created by write_sdc
# Sun May 25 19:14:59 2025
###############################################################################
current_design register_file
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg1[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg1[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg1[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg2[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg2[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readReg2[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {regWrite}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeData[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeReg[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeReg[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {writeReg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData1[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {readData2[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {readData1[7]}]
set_load -pin_load 0.0334 [get_ports {readData1[6]}]
set_load -pin_load 0.0334 [get_ports {readData1[5]}]
set_load -pin_load 0.0334 [get_ports {readData1[4]}]
set_load -pin_load 0.0334 [get_ports {readData1[3]}]
set_load -pin_load 0.0334 [get_ports {readData1[2]}]
set_load -pin_load 0.0334 [get_ports {readData1[1]}]
set_load -pin_load 0.0334 [get_ports {readData1[0]}]
set_load -pin_load 0.0334 [get_ports {readData2[7]}]
set_load -pin_load 0.0334 [get_ports {readData2[6]}]
set_load -pin_load 0.0334 [get_ports {readData2[5]}]
set_load -pin_load 0.0334 [get_ports {readData2[4]}]
set_load -pin_load 0.0334 [get_ports {readData2[3]}]
set_load -pin_load 0.0334 [get_ports {readData2[2]}]
set_load -pin_load 0.0334 [get_ports {readData2[1]}]
set_load -pin_load 0.0334 [get_ports {readData2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {regWrite}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {readReg2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeData[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeReg[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeReg[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {writeReg[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
